tap "buo/cask-upgrade"
tap "tsung-ju/iguanatexmac"
tap "wickenico/wailbrew"
# tap "TheBoredTeam/boring-notch"

# Set arguments passed to all `brew install --cask` commands for `cask "..."`
cask_args appdir: "~/Applications", require_sha: true

# Mac App Store command-line interface
brew "mas"
# Internet file retriever
brew "wget"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Distributed revision control system
brew "git"
# GitHub command-line tool
brew "gh"
# UNIX shell (command interpreter)
brew "zsh"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Open-source, cross-platform JavaScript runtime environment
brew "node@24"
# Improved top (interactive process viewer)
brew "htop"
# Software environment for statistical computing
brew "r"
# Display and control your Android device
brew "scrcpy"

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", greedy: true
# Open-source code editor
cask "visual-studio-code", greedy: true
# Desktop client for GitHub repositories
cask "github", greedy: true
# App to build and share containerised applications and microservices
cask "docker-desktop", greedy: true
#  Vivaldi Web browser
# cask "vivaldi", greedy: true
# Full TeX Live distribution with GUI applications
# cask "mactex", greedy: true
# LaTeX typesetting for PowerPoint
cask "iguanatexmac"
cask "latexit-metadata" # as per installation instruction for iguanatexmac via homebrew
# Manage Homebrew packages with a UI
# cask "wailbrew"
# Anthropic's official Claude AI desktop app
cask "claude", greedy: true
# Multi-agent programmable modelling environment
cask "netlogo"
# Collect, organise, cite, and share research sources
cask "zotero"
# Web browser environment to carry out e-assessments safely
cask "safe-exam-browser", args: { appdir: "/Applications" }
# File archiver
cask "keka"
# Unpacks archive files
cask "the-unarchiver"
# Display management tool
# cask "betterdisplay"
# The boring notch (https://theboring.name)
# cask "boring-notch"
# Write, edit, and chat about your code with AI
cask "cursor", greedy: true
# Client for the Tresorit cloud storage service
# cask "tresorit"
# Desktop syncing client for ownCloud => switchdrive client
# cask "owncloud"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Data science software focusing on R and Python
cask "rstudio"
# Visual diff and merge tool
cask "meld"
# Solve, save and share math problems, graph functions, etc
cask "geogebra@5"
# Visual diff and merge tool
cask "meld"
# Electronics prototyping platform
cask "arduino-ide"
# Client for the Google Drive storage service => no checksum
# cask "google-drive"
# Evaluator for the Wolfram Language
cask "wolfram-engine"
# Javascript frontend for Wolfram Engine
cask "wljs-notebook"
# Android SDK Platform-Tools
cask "android-platform-tools"


# Fonts (Homebrew casks)
cask "font-fira-code"
cask "font-fira-sans"
# cask "font-inconsolata"
# cask "font-source-code-pro"
# cask "font-source-sans-3"


# vscode "affenwiesel.matlab-formatter"
# vscode "ban.spellright"
# vscode "christian-kohler.path-intellisense"
# vscode "docker.docker"
# vscode "eamodio.gitlens"
# vscode "esbenp.prettier-vscode"
# vscode "george-alisson.html-preview-vscode"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "james-yu.latex-workshop"
# vscode "mathworks.language-matlab"
# vscode "mechatroner.rainbow-csv"
# vscode "ms-azuretools.vscode-containers"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.black-formatter"
# vscode "ms-python.debugpy"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-python.vscode-python-envs"
# vscode "ms-toolsai.datawrangler"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-wsl"
# vscode "ms-vscode.makefile-tools"
# vscode "njpwerner.autodocstring"
# vscode "rdebugger.r-debugger"
# vscode "reditorsupport.r"
# vscode "reditorsupport.r-syntax"
# vscode "sleepingsaint.gitignore-generator"
# vscode "visualstudioexptteam.intellicode-api-usage-examples"
# vscode "visualstudioexptteam.vscodeintellicode"
# vscode "xabikos.javascriptsnippets"
# vscode "yzhang.markdown-all-in-one"
# vscode "zainchen.json"
