tap "buo/cask-upgrade"
tap "rajivm1991/droiddock"

# Set arguments passed to all `brew install --cask` commands for `cask "..."`
cask_args appdir: "~/Applications", require_sha: true


# Port of pdftk in java
brew "pdftk-java"


# Voice and text chat software
cask "discord"
# Music streaming service
# cask "tidal", greedy: true # switched to PWA version
# Video communication and virtual meeting platform
cask "zoom", greedy: true
# Manage audio systems
cask "bluos-controller"
# Folder comparison and synchronization software
cask "freefilesync"
# Server and cloud storage browser
cask "cyberduck"
# Free cross-platform office suite
cask "libreoffice"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# todo list
cask "todoist-app"
# Free and open-source image editor
cask "gimp"
# webbrowser
cask "firefox"
# Gecko based web browser
cask "zen"
# Customizable email client
cask "thunderbird"
# Personalised focus music
cask "focusatwill"
# PDF reader and note-taking application
cask "skim"
# Window peeking utility app
cask "dockdoor"
# Screenshot measurement and annotation tool
cask "shottr"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# Unicode keyboard layout editor
cask "ukelele"
# Email client
cask "fastmail"
# Browse Android files on macOS
cask "droiddock"
